---
kind: property
id: P:Autodesk.Revit.DB.Architecture.CutMarkType.CutMarkSymbolSize
source: html/3ac09c30-2ccd-5d30-2490-b290a7f13d3b.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkType.CutMarkSymbolSize Property

The size of the cut mark symbol.

## Syntax (C#)
```csharp
public double CutMarkSymbolSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for cutMarkSymbolSize must be greater than 0 and no more than 30000 feet.